# Python_Project_7 :- Credit Card

In [1]:
import pandas as pd

In [2]:
import numpy as np

# Customer Acqusition

cust=pd.read_csv(r"C:\Users\crmwe\Desktop\Python_Project\Customer Acqusition.csv")

In [4]:
cust.head()

   No Customer  Age       City   Product     Limit Company        Segment
0   1       A1   76  BANGALORE      Gold  500000.0      C1  Self Employed
1   2       A2   71   CALCUTTA    Silver  100000.0      C2   Salaried_MNC
2   3       A3   34     COCHIN  Platimum   10000.0      C3   Salaried_Pvt
3   4       A4   47     BOMBAY  Platimum   10001.0      C4           Govt
4   5       A5   56  BANGALORE  Platimum   10002.0      C5  Normal Salary

In [6]:
cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   No        100 non-null    int64
 1   Customer  100 non-null    object
 2   Age       100 non-null    int64
 3   City      100 non-null    object
 4   Product   100 non-null    object
 5   Limit     100 non-null    float64
 6   Company   100 non-null    object
 7   Segment   100 non-null    object
dtypes: float64(1), int64(2), object(5)
memory usage: 6.4+ KB

In [7]:
cust.isnull().sum()

No          0
Customer    0
Age         0
City        0
Product     0
Limit       0
Company     0
Segment     0
dtype: int64

# Repayment

rep=pd.read_csv(r"C:\Users\crmwe\Desktop\Python_Project\Repayment.csv")

In [9]:
rep.head()

   SL No: Customer      Month     Amount  Unnamed: 4
0     NaN       A1  12-Jan-04  495414.75         NaN
1     2.0       A1   3-Jan-04  245899.02         NaN
2     3.0       A1  15-Jan-04  259490.06         NaN
3     4.0       A1  25-Jan-04  437555.12         NaN
4     5.0       A1  17-Jan-05  165972.88         NaN

In [10]:
rep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1523 entries, 0 to 1522
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   SL No:      1499 non-null   float64
 1   Customer    1500 non-null   object
 2   Month       1500 non-null   object
 3   Amount      1500 non-null   float64
 4   Unnamed: 4  0 non-null      float64
dtypes: float64(3), object(2)
memory usage: 59.6+ KB

In [11]:
rep.drop(['Unnamed: 4','SL No:'],axis=1,inplace=True)

In [12]:
rep.head()

  Customer      Month     Amount
0       A1  12-Jan-04  495414.75
1       A1   3-Jan-04  245899.02
2       A1  15-Jan-04  259490.06
3       A1  25-Jan-04  437555.12
4       A1  17-Jan-05  165972.88

In [14]:
rep.dropna(axis=0,inplace=True)

In [15]:
rep.isnull().sum()

Customer    0
Month       0
Amount      0
dtype: int64

# Spend

sep=pd.read_csv(r"C:\Users\crmwe\Desktop\Python_Project\spend.csv")

In [18]:
sep.head()

   Sl No: Customer      Month       Type     Amount
0       1       A1  12-Jan-04  JEWELLERY  485470.80
1       2       A1   3-Jan-04      PETRO  410556.13
2       3       A1  15-Jan-04    CLOTHES   23740.46
3       4       A1  25-Jan-04       FOOD  484342.47
4       5       A1  17-Jan-05     CAMERA  369694.07

In [19]:
sep.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sl No:    1500 non-null   int64
 1   Customer  1500 non-null   object
 2   Month     1500 non-null   object
 3   Type      1500 non-null   object
 4   Amount    1500 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 58.7+ KB

In [20]:
sep.isnull().sum()

Sl No:      0
Customer    0
Month       0
Type        0
Amount      0
dtype: int64

# ************************** Merging_Data_Set*************************************

In [21]:
cust_sep=pd.merge(left=cust,right=sep,on='Customer')

In [29]:
cust_sep.head()

,No,Customer,Age,City,Product,Limit,Company,Segment,Sl No:,Month,Type,Amount
0,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,1,12-Jan-04,JEWELLERY,485470.80
1,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,2,3-Jan-04,PETRO,410556.13
2,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,3,15-Jan-04,CLOTHES,23740.46
3,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,4,25-Jan-04,FOOD,484342.47
4,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,5,17-Jan-05,CAMERA,369694.07

In [44]:
cust_rep=pd.merge(left=cust,right=rep,on='Customer')

In [45]:
cust_rep.head()

,No,Customer,Age,City,Product,Limit,Company,Segment,Month,Amount
0,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,12-Jan-04,495414.75
1,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,3-Jan-04,245899.02
2,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,15-Jan-04,259490.06
3,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,25-Jan-04,437555.12
4,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,17-Jan-05,165972.88

# ***************************** Opretion Perform *************************************

1.How many distinct customers exist ?

In [25]:
cust_sep['Customer'].drop_duplicates().count()

100

2.How many distinct categories exist ?

In [32]:
cust_sep['Product'].drop_duplicates().count()

3

3.What are the top 5 product types ?

In [68]:
cust_sep.groupby('Type').Amount.sum().nlargest()

Type
PETRO           49863174.09
CAMERA          41481571.96
FOOD            37773338.43
TRAIN TICKET    33067077.15
AIR TICKET      32955445.42
Name: Amount, dtype: float64

4.Which city is having maximum spend ?

In [36]:
cust_sep.groupby('City').Amount.sum().nlargest()

City
COCHIN       73495349.26
BANGALORE    69342631.62
CALCUTTA     64415760.01
BOMBAY       50828266.74
CHENNAI      32674988.07
Name: Amount, dtype: float64

5.Which age group is spending more money ?

In [39]:
cust_sep['Age_Category']=np.where(((cust_sep.Age.astype(int) >= 18) & (cust_sep.Age.astype(int) < 25)), 'Youth',
np.where(((cust_sep.Age.astype(int) >= 25) & (cust_sep.Age.astype(int) < 65)), 'Adult','Senior'))

In [47]:
cust_sep.head()

,No,Customer,Age,City,Product,Limit,Company,Segment,Sl No:,Month,Type,Amount,Age_Group,Age_Category
0,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,1,12-Jan-04,JEWELLERY,485470.80,Senior,Senior
1,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,2,3-Jan-04,PETRO,410556.13,Senior,Senior
2,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,3,15-Jan-04,CLOTHES,23740.46,Senior,Senior
3,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,4,25-Jan-04,FOOD,484342.47,Senior,Senior
4,1,A1,76,BANGALORE,Gold,500000.0,C1,Self Employed,5,17-Jan-05,CAMERA,369694.07,Senior,Senior

In [43]:
cust_sep.groupby('Age_Category').Amount.sum().nlargest()

Age_Category
Adult     2.713165e+08
Senior    7.227785e+07
Youth     2.104976e+07
Name: Amount, dtype: float64

6.Who are the top 10 customers in terms of repayment ?

In [52]:
cust_rep.groupby('Customer').Amount.sum().nlargest(10)

Customer
A61    10539142.91
A60     9876290.74
A13     9572000.66
A22     9372561.68
A21     9056336.15
A43     8489871.46
A45     8448334.87
A12     8334760.16
A48     8292416.75
A14     7943268.63
Name: Amount, dtype: float64

7.What is the average monthly spend by customers ?

In [59]:
cust_sep.groupby('Customer').Amount.mean()

Customer
A1      285705.708889
A10     213745.813889
A100    224786.880000
A11     250957.093889
A12     263969.375484
            ...
A95     240401.500000
A96      54729.660000
A97     139018.260000
A98     284521.060000
A99      90184.220000
Name: Amount, Length: 100, dtype: float64

8.What is the average monthly repayment by customers ?

In [62]:
cust_rep.groupby('Customer').Amount.mean()

Customer
A1      264093.981667
A10     205313.751111
A100     69551.190000
A11     295051.890556
A12     268863.230968
            ...
A95     369405.960000
A96     310992.300000
A97     121874.900000
A98     337815.570000
A99      25682.730000
Name: Amount, Length: 100, dtype: float64